Stats/Consolidation/KVM/mmap_0.log
file1: (g=0): rw=randrw, bs=256K-256K/256K-256K/256K-256K, ioengine=mmap, iodepth=4
file2: (g=0): rw=randrw, bs=256K-256K/256K-256K/256K-256K, ioengine=mmap, iodepth=32
file3: (g=0): rw=randrw, bs=256K-256K/256K-256K/256K-256K, ioengine=mmap, iodepth=8
file4: (g=0): rw=randrw, bs=256K-256K/256K-256K/256K-256K, ioengine=mmap, iodepth=16
fio-2.2.8
Starting 4 processes
file1: Laying out IO file(s) (1 file(s) / 512MB)
file2: Laying out IO file(s) (1 file(s) / 512MB)
file3: Laying out IO file(s) (1 file(s) / 512MB)
file4: Laying out IO file(s) (1 file(s) / 512MB)

file1: (groupid=0, jobs=1): err= 0: pid=2289: Mon Feb 22 16:17:19 2016
  read : io=270848KB, bw=1367.3KB/s, iops=5, runt=198130msec
    clat (msec): min=14, max=380, avg=86.39, stdev=68.92
     lat (msec): min=14, max=380, avg=86.39, stdev=68.92
    clat percentiles (msec):
     |  1.00th=[   15],  5.00th=[   15], 10.00th=[   15], 20.00th=[   15],
     | 30.00th=[   16], 40.00th=[   16], 50.00th=[   99], 60.00th=[  123],
     | 70.00th=[  133], 80.00th=[  149], 90.00th=[  172], 95.00th=[  190],
     | 99.00th=[  243], 99.50th=[  251], 99.90th=[  306], 99.95th=[  379],
     | 99.99th=[  379]
    bw (KB  /s): min=  357, max= 4007, per=26.04%, avg=1424.12, stdev=715.57
  write: io=253440KB, bw=1279.2KB/s, iops=4, runt=198130msec
    clat (msec): min=26, max=348, avg=107.73, stdev=72.48
     lat (msec): min=26, max=348, avg=107.74, stdev=72.48
    clat percentiles (msec):
     |  1.00th=[   28],  5.00th=[   32], 10.00th=[   36], 20.00th=[   37],
     | 30.00th=[   37], 40.00th=[   39], 50.00th=[  117], 60.00th=[  143],
     | 70.00th=[  159], 80.00th=[  167], 90.00th=[  200], 95.00th=[  225],
     | 99.00th=[  297], 99.50th=[  314], 99.90th=[  351], 99.95th=[  351],
     | 99.99th=[  351]
    bw (KB  /s): min=  321, max= 2154, per=25.15%, avg=1286.57, stdev=406.84
    lat (msec) : 20=22.07%, 50=21.78%, 100=5.08%, 250=49.46%, 500=1.61%
  cpu          : usr=0.08%, sys=9.34%, ctx=136072, majf=131072, minf=33
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1058/w=990/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=4
file2: (groupid=0, jobs=1): err= 0: pid=2290: Mon Feb 22 16:17:19 2016
  read : io=270848KB, bw=1367.4KB/s, iops=5, runt=198085msec
    clat (msec): min=14, max=302, avg=89.42, stdev=70.58
     lat (msec): min=14, max=302, avg=89.42, stdev=70.58
    clat percentiles (msec):
     |  1.00th=[   15],  5.00th=[   15], 10.00th=[   15], 20.00th=[   15],
     | 30.00th=[   16], 40.00th=[   16], 50.00th=[  104], 60.00th=[  124],
     | 70.00th=[  139], 80.00th=[  155], 90.00th=[  180], 95.00th=[  198],
     | 99.00th=[  249], 99.50th=[  262], 99.90th=[  302], 99.95th=[  302],
     | 99.99th=[  302]
    bw (KB  /s): min=  349, max= 4071, per=26.21%, avg=1433.34, stdev=743.65
  write: io=253440KB, bw=1279.5KB/s, iops=4, runt=198085msec
    clat (msec): min=24, max=383, avg=104.46, stdev=72.30
     lat (msec): min=24, max=383, avg=104.47, stdev=72.30
    clat percentiles (msec):
     |  1.00th=[   28],  5.00th=[   28], 10.00th=[   30], 20.00th=[   35],
     | 30.00th=[   37], 40.00th=[   38], 50.00th=[  114], 60.00th=[  143],
     | 70.00th=[  151], 80.00th=[  167], 90.00th=[  184], 95.00th=[  225],
     | 99.00th=[  297], 99.50th=[  326], 99.90th=[  383], 99.95th=[  383],
     | 99.99th=[  383]
    bw (KB  /s): min=  334, max= 2361, per=25.16%, avg=1287.32, stdev=423.37
    lat (msec) : 20=21.48%, 50=22.07%, 100=5.57%, 250=49.12%, 500=1.76%
  cpu          : usr=0.08%, sys=9.34%, ctx=135992, majf=131072, minf=33
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1058/w=990/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
file3: (groupid=0, jobs=1): err= 0: pid=2291: Mon Feb 22 16:17:19 2016
  read : io=270848KB, bw=1374.5KB/s, iops=5, runt=197054msec
    clat (msec): min=14, max=355, avg=90.08, stdev=71.64
     lat (msec): min=14, max=356, avg=90.09, stdev=71.65
    clat percentiles (msec):
     |  1.00th=[   15],  5.00th=[   15], 10.00th=[   15], 20.00th=[   15],
     | 30.00th=[   16], 40.00th=[   17], 50.00th=[  104], 60.00th=[  123],
     | 70.00th=[  139], 80.00th=[  155], 90.00th=[  174], 95.00th=[  204],
     | 99.00th=[  265], 99.50th=[  281], 99.90th=[  318], 99.95th=[  355],
     | 99.99th=[  355]
    bw (KB  /s): min=  357, max= 3246, per=26.24%, avg=1434.85, stdev=712.07
  write: io=253440KB, bw=1286.2KB/s, iops=5, runt=197054msec
    clat (msec): min=26, max=358, avg=102.71, stdev=71.83
     lat (msec): min=26, max=358, avg=102.72, stdev=71.84
    clat percentiles (msec):
     |  1.00th=[   28],  5.00th=[   30], 10.00th=[   32], 20.00th=[   36],
     | 30.00th=[   37], 40.00th=[   38], 50.00th=[  100], 60.00th=[  143],
     | 70.00th=[  151], 80.00th=[  167], 90.00th=[  184], 95.00th=[  217],
     | 99.00th=[  293], 99.50th=[  322], 99.90th=[  359], 99.95th=[  359],
     | 99.99th=[  359]
    bw (KB  /s): min=  354, max= 2310, per=25.35%, avg=1296.90, stdev=413.41
    lat (msec) : 20=21.34%, 50=23.05%, 100=5.57%, 250=47.85%, 500=2.20%
  cpu          : usr=0.09%, sys=9.44%, ctx=136062, majf=131072, minf=32
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1058/w=990/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=8
file4: (groupid=0, jobs=1): err= 0: pid=2292: Mon Feb 22 16:17:19 2016
  read : io=270848KB, bw=1370.9KB/s, iops=5, runt=197687msec
    clat (msec): min=14, max=332, avg=88.18, stdev=69.63
     lat (msec): min=14, max=332, avg=88.18, stdev=69.63
    clat percentiles (msec):
     |  1.00th=[   15],  5.00th=[   15], 10.00th=[   15], 20.00th=[   15],
     | 30.00th=[   16], 40.00th=[   16], 50.00th=[  105], 60.00th=[  123],
     | 70.00th=[  139], 80.00th=[  151], 90.00th=[  174], 95.00th=[  190],
     | 99.00th=[  258], 99.50th=[  273], 99.90th=[  281], 99.95th=[  334],
     | 99.99th=[  334]
    bw (KB  /s): min=  382, max= 3569, per=26.23%, avg=1434.07, stdev=711.86
  write: io=253440KB, bw=1282.3KB/s, iops=5, runt=197687msec
    clat (msec): min=25, max=353, avg=105.37, stdev=70.63
     lat (msec): min=25, max=353, avg=105.38, stdev=70.64
    clat percentiles (msec):
     |  1.00th=[   28],  5.00th=[   30], 10.00th=[   33], 20.00th=[   36],
     | 30.00th=[   37], 40.00th=[   39], 50.00th=[  116], 60.00th=[  143],
     | 70.00th=[  151], 80.00th=[  167], 90.00th=[  192], 95.00th=[  223],
     | 99.00th=[  285], 99.50th=[  306], 99.90th=[  355], 99.95th=[  355],
     | 99.99th=[  355]
    bw (KB  /s): min=  347, max= 2281, per=25.15%, avg=1286.76, stdev=425.19
    lat (msec) : 20=21.78%, 50=21.78%, 100=4.88%, 250=49.71%, 500=1.86%
  cpu          : usr=0.09%, sys=9.42%, ctx=136070, majf=131072, minf=33
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1058/w=990/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: io=1058.0MB, aggrb=5468KB/s, minb=1367KB/s, maxb=1374KB/s, mint=197054msec, maxt=198130msec
  WRITE: io=990.0MB, aggrb=5116KB/s, minb=1279KB/s, maxb=1286KB/s, mint=197054msec, maxt=198130msec

Disk stats (read/write):
    dm-1: ios=524290/12186, merge=0/0, ticks=682636/96344, in_queue=778989, util=100.00%, aggrios=524290/16144, aggrmerge=0/6, aggrticks=681501/93126, aggrin_queue=774158, aggrutil=100.00%
  sda: ios=524290/16144, merge=0/6, ticks=681501/93126, in_queue=774158, util=100.00%